mathiscastel29560-arch/Esp32/src/menu.cpp
#include "menu.h"
#include "menu_icons.h"
#include "buttons.h"
#include "config.h"
#include "tx_arm.h"
#include "wifi_tools.h"
#include "ble_tools.h"
#include "nrf24_tools.h"
#include "subghz.h"
#include "beacon_spam.h"
#include "evil_portal.h"
#include "ir_tools.h"
#include "ir_bruteforce.h"
#include "ble_spam_detector.h"
#include "rtc_clock.h"
#include "gps_module.h"
#include "battery.h"
#include "help_content.h"
#include "drone_tracker.h"
#include "signal_sniffer.h"
#include "subghz_bruteforce.h"
#include "subghz_replay.h"
#include "subghz_scanner.h"
#include "gps_wardriving.h"
#include "nrf24_replay.h"
#include "wifi_hidden_revealer.h"
#include "iot_device_hunter.h"
#include "ble_spoof.h"
#include "frequency_analyzer.h"
#include "ble_pairing_attack.h"
#include "nrf24_injection.h"
#include "smart_lock_scanner.h"
#include "subghz_protocol_analyzer.h"
#include "ble_dos.h"
#include "ble_beacon_spam.h"
#include "wifi_deauth.h"
#include "ble_advertising_jammer.h"
#include "gps_spoof.h"
#include "advanced_rf_jammer.h"
#include "wifi_jammer_suite.h"
#include "bluetooth_aggressive_jammer.h"
#include "subghz_jammer_suite.h"
#include "ble_advanced_attack_suite.h"
#include "jamming_signal_generator.h"
#include "wpa2_handshake_cracker.h"
#include "wifi_association_hijacker.h"
#include "http_downgrade_attack.h"
#include "rf_signal_recorder.h"
#include "signal_decoder.h"
#include "advanced_signal_cloner.h"
#include <vector>
#include <set>

namespace {

enum State {
    HOME,
    MAIN_MENU,
    WIFI_SUBMENU,
    BLE_SUBMENU,
    RF_SUBMENU,
    SYSTEM_SUBMENU,
    HELP_SUBMENU,
    RESULT_SCREEN,
};

State g_state = HOME;
int g_selection = 0;
String g_resultTitle, g_resultBody;
uint32_t g_resultShowTime = 0;

// Debounced button tracking
bool g_backHeld = false;
uint32_t g_backHeldSince = 0;

bool consumeBackTap() {
    bool now = TxArm::isArmed();
    bool tapped = false;
    if (now && !g_backHeld) {
        g_backHeldSince = millis();
    } else if (!now && g_backHeld) {
        if (millis() - g_backHeldSince < 500) tapped = true;
    }
    g_backHeld = now;
    return tapped;
}

std::vector<String> mainMenuItems() {
    return {
        "📡 WiFi Tools",
        "🔵 BLE Tools",
        "📶 RF/2.4GHz",
        "⚙️  System",
        "❓ Help",
    };
}

std::vector<String> wifiMenuItems() {
    return {
        "📡 Scan Networks",
        "📡 Reveal Hidden Networks",
        "📡 IoT Device Hunter",
        "📡 Smart Lock Scanner",
        "📡 Frequency Analyzer",
        "📡 Beacon Spam " + String(BeaconSpam::active() ? "STOP" : "start"),
        "📡 Evil Portal " + String(EvilPortal::active() ? "STOP" : "start"),
        "📡 WiFi Deauth " + String(WiFiDeauth::isActive() ? "STOP" : "start"),
        "📡 WiFi Jammer Suite " + String(WiFiJammerSuite::isActive() ? "STOP" : "start"),
        "📡 Association Hijacker",
        "📡 HTTP Downgrade Attack",
        "📡 WPA2 Handshake Cracker",
        "🔙 Back",
    };
}

std::vector<String> bleMenuItems() {
    return {
        "🔵 Scan Devices (5s)",
        "🔵 BLE Address Spoof",
        "🔵 BLE Pairing Attack",
        "🔵 BLE DoS Attack",
        "🔵 BLE Beacon Spam " + String(BLEBeaconSpam::isActive() ? "STOP" : "start"),
        "🔵 BLE Advertising Jam " + String(BLEAdvertisingJammer::isActive() ? "STOP" : "start"),
        "🔵 Bluetooth Aggressive Jam " + String(BluetoothAggressiveJammer::isActive() ? "STOP" : "start"),
        "🔵 BLE Advanced Attacks " + String(BLEAdvancedAttackSuite::isActive() ? "STOP" : "start"),
        "🔵 BLE Spam Watch " + String(BleSpamDetector::active() ? "STOP" : "start"),
        "🔵 Check Spam Alert",
        "🔙 Back",
    };
}

std::vector<String> rfMenuItems() {
    return {
        "📶 2.4GHz Spectrum Scan",
        "📶 Drone Tracker (RSSI)",
        "📶 Signal Sniffer (NRF24)",
        "📶 NRF24 Replay Attack",
        "📶 Sub-GHz Scanner",
        "📶 Sub-GHz Bruteforce",
        "📶 Sub-GHz Replay",
        "🔴 IR: TV Power Toggle",
        "🔴 IR: Bruteforce TV",
        "🔴 IR: Bruteforce AC",
        "🔴 IR: Bruteforce Light",
        "🛰️  GPS Spoofing (2.4GHz)",
        "📶 Advanced RF Jammer " + String(AdvancedRFJammer::isActive() ? "STOP" : "start"),
        "📶 Sub-GHz Jammer Suite " + String(SubghzJammerSuite::isActive() ? "STOP" : "start"),
        "📶 Jamming Signal Gen " + String(JammingSignalGenerator::isActive() ? "STOP" : "start"),
        "📶 RF Signal Recorder",
        "📶 Signal Decoder",
        "📶 Advanced Signal Cloner",
        "🔙 Back",
    };
}

std::vector<String> systemMenuItems() {
    return {
        "⚙️  TX Arm Status",
        "🔋 Battery Status",
        "🗺️  GPS Map",
        "🔄 Dualboot OTA1",
        "🔙 Back",
    };
}

std::vector<String> helpMenuItems() {
    std::vector<String> items;
    String lastCat = "";

    for (size_t i = 0; i < HelpContent::TOPIC_COUNT; i++) {
        String cat = HelpContent::TOPICS[i].category;
        if (cat != lastCat) {
            items.push_back(String("[") + cat.substring(0, 1) + "] " + cat);
            lastCat = cat;
        }
    }
    items.push_back("Back");
    return items;
}

void showResult(const String &title, const String &body) {
    g_resultTitle = title;
    g_resultBody = body;
    g_resultShowTime = millis();
    g_state = RESULT_SCREEN;
}

void runWifiAction(int idx) {
    switch (idx) {
        case 0: { // Scan
            auto results = WifiTools::scan();
            if (results.empty()) {
                showResult("WiFi Scan", "No networks found");
            } else {
                showResult("WiFi Scan",
                          String(results.size()) + " networks found\n" +
                          "Best: " + results[0].ssid + " " + String(results[0].rssi) + "dBm");
            }
            break;
        }
        case 1: { // Reveal hidden networks
            auto result = WiFiHiddenRevealer::revealHiddenNetworks(10000);
            if (result.networksFound > 0) {
                showResult("Hidden Networks",
                          "Found: " + String(result.networksFound) + "\n" +
                          "Check logs for details");
            } else {
                showResult("Hidden Networks", "No hidden networks found");
            }
            break;
        }
        case 2: { // IoT Device Hunter
            auto result = IoTDeviceHunter::huntDevices(15000);
            if (result.devicesFound > 0) {
                showResult("IoT Devices",
                          "Found: " + String(result.devicesFound) + "\n" +
                          "Smart devices detected");
            } else {
                showResult("IoT Devices", "No IoT devices found");
            }
            break;
        }
        case 3: { // Smart Lock Scanner
            auto result = SmartLockScanner::scanSmartLocks(15000);
            if (result.locksFound > 0) {
                showResult("Smart Lock Scanner",
                          "Found: " + String(result.locksFound) + " locks\n" +
                          "Check logs for details");
            } else {
                showResult("Smart Lock Scanner", "No smart locks found");
            }
            break;
        }
        case 4: { // Frequency Analyzer
            auto result = FrequencyAnalyzer::analyzeBands(20000);
            showResult("Frequency Analysis",
                      "Signals: " + String(result.totalSignals) + "\n" +
                      "Bands analyzed: 2.4GHz + 433MHz");
            break;
        }
        case 5: { // Beacon spam toggle
            if (BeaconSpam::active()) {
                BeaconSpam::stop();
                showResult("Beacon Spam", "STOPPED");
            } else {
                std::vector<String> ssids = {"TEST-AP-1", "TEST-AP-2", "Free-WiFi"};
                if (BeaconSpam::start(ssids)) {
                    showResult("Beacon Spam", "STARTED\n(Hold BACK to arm)");
                } else {
                    showResult("Beacon Spam", "Failed to start");
                }
            }
            break;
        }
        case 6: { // Evil Portal toggle
            if (EvilPortal::active()) {
                EvilPortal::stop();
                showResult("Evil Portal", "STOPPED");
            } else {
                if (EvilPortal::start("Free-WiFi", 600000)) {
                    showResult("Evil Portal", "STARTED\nCheck logs/");
                } else {
                    showResult("Evil Portal", "Failed to start");
                }
            }
            break;
        }
        case 7: { // WiFi Deauth
            if (WiFiDeauth::isActive()) {
                WiFiDeauth::stop();
                showResult("WiFi Deauth", "STOPPED");
            } else {
                auto result = WiFiDeauth::sendDeauthFrames("FF:FF:FF:FF:FF:FF", 15000, true);
                showResult("WiFi Deauth",
                          "Sent: " + String(result.deauthCount) + " frames\n" +
                          "Rate: " + String((result.deauthCount * 1000) / 15000) + "/sec");
            }
            break;
        }
        case 8: { // WiFi Jammer Suite
            if (WiFiJammerSuite::isActive()) {
                WiFiJammerSuite::stop();
                showResult("WiFi Jammer", "STOPPED");
            } else {
                auto result = WiFiJammerSuite::jamWiFiNetwork(6, 10000, "ALL");
                showResult("WiFi Jammer Suite",
                          "Sent: " + String(result.jamPacketsCount) + " packets\n" +
                          "Rate: " + String((result.jamPacketsCount * 1000) / 10000) + "/sec");
            }
            break;
        }
        case 9: { // Association Hijacker
            auto result = WiFiAssociationHijacker::hijackAssociation("AA:BB:CC:DD:EE:FF", 10000);
            showResult("WiFi Association Hijack",
                      "Spoofed: " + result.spoofedMAC + "\n" +
                      "Attempts: " + String(result.associationsCount));
            break;
        }
        case 10: { // HTTP Downgrade Attack
            auto result = HTTPDowngradeAttack::executeDowngrade(20000);
            showResult("HTTP Downgrade (SSL Strip)",
                      "Redirects: " + String(result.redirectsCount) + "\n" +
                      "Creds captured: " + String(result.credentialsIntercepted));
            break;
        }
        case 11: { // WPA2 Handshake Cracker
            auto result = WPA2HandshakeCracker::captureAndCrack("TestNetwork", 30000);
            showResult("WPA2 Cracker",
                      "Password: " + (result.passwordFound ? result.password : "NOT FOUND") + "\n" +
                      "Attempts: " + String(result.attemptsCount));
            break;
        }
    }
}

void runBleAction(int idx) {
    switch (idx) {
        case 0: { // Scan
            auto results = BleTools::scan(5);
            if (results.empty()) {
                showResult("BLE Scan", "No devices found");
            } else {
                showResult("BLE Scan",
                          String(results.size()) + " devices found\n" +
                          "Best: " + results[0].name + " " + String(results[0].rssi) + "dBm");
            }
            break;
        }
        case 1: { // BLE Address Spoof
            auto result = BLESpoof::spoofBLEAddress("SmartDevice", "AA:BB:CC:DD:EE:FF");
            showResult("BLE Address Spoof",
                      "Spoofed: " + result.spoofedMAC + "\n" +
                      "Advertising as: " + result.targetDevice);
            break;
        }
        case 2: { // BLE Pairing Attack
            auto result = BLEPairingAttack::attackPairing("Target", 10000);
            showResult("BLE Pairing Attack",
                      "Attempts: " + String(result.attemptsCount) + "\n" +
                      "Method: " + result.method);
            break;
        }
        case 3: { // BLE DoS Attack
            auto result = BLE_DOS::launchDOS("AllDevices", 10000);
            showResult("BLE DoS Attack",
                      "Packets sent: " + String(result.packetsCount) + "\n" +
                      "Method: " + result.method);
            break;
        }
        case 4: { // BLE Beacon Spam
            if (BLEBeaconSpam::isActive()) {
                BLEBeaconSpam::stop();
                showResult("BLE Beacon Spam", "STOPPED");
            } else {
                auto result = BLEBeaconSpam::spamBeacons("ALL", 15000);
                showResult("BLE Beacon Spam",
                          "Sent: " + String(result.beaconsCount) + " beacons\n" +
                          "Rate: ~" + String((result.beaconsCount * 1000) / result.durationMs) + "/sec");
            }
            break;
        }
        case 5: { // BLE Advertising Jammer
            if (BLEAdvertisingJammer::isActive()) {
                BLEAdvertisingJammer::stop();
                showResult("BLE Advertising Jam", "STOPPED");
            } else {
                auto result = BLEAdvertisingJammer::jamAdvertising(15000, "NOISE");
                showResult("BLE Advertising Jam",
                          "Sent: " + String(result.jamPacketsCount) + " jam packets\n" +
                          "Rate: ~" + String((result.jamPacketsCount * 1000) / 15000) + "/sec");
            }
            break;
        }
        case 6: { // Bluetooth Aggressive Jammer
            if (BluetoothAggressiveJammer::isActive()) {
                BluetoothAggressiveJammer::stop();
                showResult("Bluetooth Aggressive Jam", "STOPPED");
            } else {
                auto result = BluetoothAggressiveJammer::jamBluetooth(15000);
                showResult("Bluetooth Aggressive Jam",
                          "Sent: " + String(result.jamPacketsCount) + " packets\n" +
                          "Duration: " + String(result.durationMs) + "ms");
            }
            break;
        }
        case 7: { // BLE Advanced Attack Suite
            if (BLEAdvancedAttackSuite::isActive()) {
                BLEAdvancedAttackSuite::stop();
                showResult("BLE Advanced Attacks", "STOPPED");
            } else {
                auto result = BLEAdvancedAttackSuite::attackBLE(15000, "ALL");
                showResult("BLE Advanced Attacks",
                          "Packets: " + String(result.attackPacketsCount) + "\n" +
                          "Method: GATT + Eavesdrop");
            }
            break;
        }
        case 8: { // Spam watch toggle
            if (BleSpamDetector::active()) {
                BleSpamDetector::stop();
                showResult("BLE Spam Watch", "STOPPED");
            } else {
                BleSpamDetector::start();
                showResult("BLE Spam Watch", "STARTED\n(passive, no TX)");
            }
            break;
        }
        case 9: { // Check alert
            auto alert = BleSpamDetector::checkAlert();
            if (alert.type.length() > 0) {
                showResult("BLE Spam Alert", alert.type + "\n" +
                          "MACs: " + String(alert.distinctMacs) + "\n" +
                          "RSSI: " + String(alert.strongestRssi) + "dBm");
            } else {
                showResult("BLE Spam Alert", "No alerts detected");
            }
            break;
        }
    }
}

void runRfAction(int idx) {
    switch (idx) {
        case 0: { // 2.4GHz spectrum
            auto activity = Nrf24Tools::scanChannels(20);
            uint8_t best = 0;
            for (size_t i = 1; i < activity.size(); i++) {
                if (activity[i] > activity[best]) best = i;
            }
            showResult("2.4GHz Spectrum",
                      "Busiest: CH" + String(best) + "\n" +
                      "Activity: " + String(activity[best]));
            break;
        }
        case 1: { // Drone Tracker
            auto result = DroneTracker::scanForDrones(5000);
            if (result.activeDroneCount > 0) {
                showResult("Drone Tracker",
                          "Channels: " + String(result.activeDroneCount) + "\n" +
                          "Avg dist: " + String(result.averageDistance, 1) + "m");
            } else {
                showResult("Drone Tracker", "No signals detected");
            }
            break;
        }
        case 2: { // Signal Sniffer
            auto result = SignalSniffer::sniffTraffic(0xFF, 3000);
            if (result.packetsCapture > 0) {
                bool hopDetected = SignalSniffer::detectFrequencyHopping(result);
                String protocol = SignalSniffer::identifyProtocol(result);
                showResult("Signal Sniffer",
                          "Packets: " + String(result.packetsCapture) + "\n" +
                          "Hopping: " + String(hopDetected ? "YES" : "NO") + "\n" +
                          "Protocol: " + protocol);
            } else {
                showResult("Signal Sniffer", "No packets captured");
            }
            break;
        }
        case 3: { // NRF24 Replay Attack
            auto pkt = Nrf24Replay::capturePacket(1, 3000);
            if (pkt.data.size() > 0) {
                auto result = Nrf24Replay::replayPacket(pkt, 5);
                showResult("NRF24 Replay",
                          "Captured: " + String(pkt.data.size()) + " bytes\n" +
                          "Replayed: " + String(result.packetsSent) + " times");
            } else {
                showResult("NRF24 Replay", "No packets captured");
            }
            break;
        }
        case 4: { // Sub-GHz Scanner
            auto result = SubghzScanner::scanBand(8000);
            if (result.detectionCount > 0) {
                showResult("Sub-GHz Scanner",
                          "Signals: " + String(result.detectionCount) + "\n" +
                          "Strongest: " + String(result.strongestSignal) + "dBm @ " +
                          String(result.busyFrequency, 2) + "MHz");
            } else {
                showResult("Sub-GHz Scanner", "No signals detected");
            }
            break;
        }
        case 5: { // Sub-GHz bruteforce
            auto result = SubghzBruteforce::bruteForce("GENERIC", 15000);
            showResult("Sub-GHz Bruteforce",
                      "Sent " + String(result.attemptsCount) + " codes\n" +
                      "Freq: " + result.frequency + " OOK\n" +
                      "Check device response!");
            break;
        }
        case 6: { // Sub-GHz Replay
            showResult("Sub-GHz Replay",
                      "Record mode not yet\nconfigured in menu\n(see source code)");
            break;
        }
        case 7: { // IR TV toggle
            showResult("IR: TV Power", "Sending codes...\n(requires IR LED)");
            break;
        }
        case 8: { // IR Bruteforce TV
            IRBruteforce::BruteResult result = IRBruteforce::bruteForce("TV", 10000);
            showResult("IR: TV Bruteforce",
                      "Sent " + String(result.attemptsCount) + " codes\n" +
                      "Check if TV responded!");
            break;
        }
        case 9: { // IR Bruteforce AC
            IRBruteforce::BruteResult result = IRBruteforce::bruteForce("AC", 10000);
            showResult("IR: AC Bruteforce",
                      "Sent " + String(result.attemptsCount) + " codes\n" +
                      "Check if AC responded!");
            break;
        }
        case 10: { // IR Bruteforce Light
            IRBruteforce::BruteResult result = IRBruteforce::bruteForce("LIGHT", 10000);
            showResult("IR: Light Bruteforce",
                      "Sent " + String(result.attemptsCount) + " codes\n" +
                      "Check if light responded!");
            break;
        }
        case 11: { // GPS Spoofing
            auto result = GPSSpoof::spoofGPS(48.8566f, 2.3522f, 20000, "SIGNAL");
            showResult("GPS Spoofing",
                      "Packets: " + String(result.packetsCount) + "\n" +
                      "Location: " + String(result.spoofedLat, 4) + ", " + String(result.spoofedLon, 4));
            break;
        }
        case 12: { // Advanced RF Jammer
            if (AdvancedRFJammer::isActive()) {
                AdvancedRFJammer::stop();
                showResult("Advanced RF Jammer", "STOPPED");
            } else {
                auto result = AdvancedRFJammer::jamRFSignals("433MHz", 10000, "NOISE");
                showResult("Advanced RF Jammer",
                          "Packets: " + String(result.jamPacketsCount) + "\n" +
                          "Method: " + result.method);
            }
            break;
        }
        case 13: { // Sub-GHz Jammer Suite
            if (SubghzJammerSuite::isActive()) {
                SubghzJammerSuite::stop();
                showResult("Sub-GHz Jammer", "STOPPED");
            } else {
                auto result = SubghzJammerSuite::jamSubghzDevices(10000);
                showResult("Sub-GHz Jammer Suite",
                          "Codes sent: " + String(result.jamPacketsCount) + "\n" +
                          "Target: 433 MHz");
            }
            break;
        }
        case 14: { // Jamming Signal Generator
            if (JammingSignalGenerator::isActive()) {
                JammingSignalGenerator::stop();
                showResult("Jamming Signal Gen", "STOPPED");
            } else {
                auto result = JammingSignalGenerator::generateJammingSignal(10000, "WHITE");
                showResult("Jamming Signal Generator",
                          "Signals: " + String(result.signalsGenerated) + "\n" +
                          "Type: " + result.noiseType);
            }
            break;
        }
        case 15: { // RF Signal Recorder
            auto result = RfSignalRecorder::recordSignals(433.0, 5000, "cc1101");
            if (result.success) {
                auto stats = RfSignalRecorder::analyzeSignal();
                showResult("RF Signal Recorder",
                          "Samples: " + String(result.sampleCount) + "\n" +
                          "RSSI: " + String(result.rssiAvg, 1) + " dBm\n" +
                          "Transitions: " + String(stats.transitionCount));
            } else {
                showResult("RF Signal Recorder", "Capture failed");
            }
            break;
        }
        case 16: { // Signal Decoder
            auto decoded = SignalDecoder::decodeSignal();
            if (decoded.success) {
                showResult("Signal Decoder",
                          "Format: " + decoded.format + "\n" +
                          "Modulation: " + decoded.modulationType + "\n" +
                          "Bitrate: " + String(decoded.estimatedBitrate) + " bps");
            } else {
                showResult("Signal Decoder", "No captured signal");
            }
            break;
        }
        case 17: { // Advanced Signal Cloner
            AdvancedSignalCloner::CloneParams params;
            params.frequency = 433.0;
            params.repeatCount = 3;
            auto result = AdvancedSignalCloner::cloneSignal(params);
            if (result.success) {
                showResult("Advanced Signal Cloner",
                          "Bytes sent: " + String(result.transmittedBytes) + "\n" +
                          "Reps: " + String(result.repetitionsCompleted) + "\n" +
                          "Radio: " + result.radioUsed);
            } else {
                showResult("Advanced Signal Cloner", "Transmission failed");
            }
            break;
        }
    }
}

