mathiscastel29560-arch/Esp32/src/menu.cpp
void runSystemAction(int idx) {
    switch (idx) {
        case 0: { // TX Arm
            showResult("TX Arm",
                      String(TxArm::isArmed() ? "ARMED" : "LOCKED") + "\n" +
                      "Hold BACK to arm");
            break;
        }
        case 1: { // Battery
            showResult("Battery",
                      String(Battery::percent()) + "%\n" +
                      String(Battery::voltage(), 2) + "V");
            break;
        }
        case 2: { // GPS
            showResult("GPS",
                      String(GpsModule::hasFix() ? "FIX OK" : "No fix") + "\n" +
                      String(GpsModule::latitude(), 4) + " " +
                      String(GpsModule::longitude(), 4));
            break;
        }
        case 3: { // Dualboot
            showResult("Dualboot",
                      "Switching to OTA1...\n(ESP32-DIV)");
            break;
        }
    }
}

void drawSimpleMenu(const std::vector<String> &items, int selection, const String &title) {
    String icon = "";
    if (title == "WIFI TOOLS") icon = "📡 ";
    else if (title == "BLE TOOLS") icon = "🔵 ";
    else if (title == "RF TOOLS") icon = "📶 ";
    else if (title == "SYSTEM") icon = "⚙️  ";
    else if (title.indexOf("HELP") >= 0) icon = "❓ ";

    Serial.println("\n═════════════════════════");
    Serial.println("  " + icon + title);
    Serial.println("═════════════════════════");
    for (size_t i = 0; i < items.size(); i++) {
        String line = String(i == selection ? "▶ " : "  ") + items[i];
        Serial.println(line);
    }
    Serial.println("─────────────────────────");
    Serial.println(" ▲/▼: navigate  ●: select  ◄: back");
}

} // namespace

namespace Menu {

void begin() {
    g_state = HOME;
    g_selection = 0;
}

void loop() {
    // Get button input
    Buttons::Button btn = Buttons::poll();
    bool upPress = (btn == Buttons::UP);
    bool dnPress = (btn == Buttons::DOWN);
    bool okPress = (btn == Buttons::SELECT);
    bool backTap = consumeBackTap();

    std::vector<String> items;

    switch (g_state) {
        case HOME:
            if (okPress) {
                g_state = MAIN_MENU;
                g_selection = 0;
            }
            Serial.println("\n*** ESP32 Audit Tool ***");
            Serial.println("Press OK to begin");
            break;

        case MAIN_MENU:
            items = mainMenuItems();
            if (upPress) g_selection = (g_selection - 1 + items.size()) % items.size();
            if (dnPress) g_selection = (g_selection + 1) % items.size();
            if (okPress) {
                switch (g_selection) {
                    case 0: g_state = WIFI_SUBMENU; break;
                    case 1: g_state = BLE_SUBMENU; break;
                    case 2: g_state = RF_SUBMENU; break;
                    case 3: g_state = SYSTEM_SUBMENU; break;
                    case 4: g_state = HELP_SUBMENU; break;
                }
                g_selection = 0;
            }
            drawSimpleMenu(items, g_selection, "MAIN");
            break;

        case WIFI_SUBMENU:
            items = wifiMenuItems();
            if (upPress) g_selection = (g_selection - 1 + items.size()) % items.size();
            if (dnPress) g_selection = (g_selection + 1) % items.size();
            if (okPress) {
                if (g_selection == items.size() - 1) {
                    g_state = MAIN_MENU;
                    g_selection = 0;
                } else {
                    runWifiAction(g_selection);
                }
            }
            drawSimpleMenu(items, g_selection, "WIFI TOOLS");
            break;

        case BLE_SUBMENU:
            items = bleMenuItems();
            if (upPress) g_selection = (g_selection - 1 + items.size()) % items.size();
            if (dnPress) g_selection = (g_selection + 1) % items.size();
            if (okPress) {
                if (g_selection == items.size() - 1) {
                    g_state = MAIN_MENU;
                    g_selection = 1;
                } else {
                    runBleAction(g_selection);
                }
            }
            drawSimpleMenu(items, g_selection, "BLE TOOLS");
            break;

        case RF_SUBMENU:
            items = rfMenuItems();
            if (upPress) g_selection = (g_selection - 1 + items.size()) % items.size();
            if (dnPress) g_selection = (g_selection + 1) % items.size();
            if (okPress) {
                if (g_selection == items.size() - 1) {
                    g_state = MAIN_MENU;
                    g_selection = 2;
                } else {
                    runRfAction(g_selection);
                }
            }
            drawSimpleMenu(items, g_selection, "RF TOOLS");
            break;

        case SYSTEM_SUBMENU:
            items = systemMenuItems();
            if (upPress) g_selection = (g_selection - 1 + items.size()) % items.size();
            if (dnPress) g_selection = (g_selection + 1) % items.size();
            if (okPress) {
                if (g_selection == items.size() - 1) {
                    g_state = MAIN_MENU;
                    g_selection = 3;
                } else {
                    runSystemAction(g_selection);
                }
            }
            drawSimpleMenu(items, g_selection, "SYSTEM");
            break;

        case HELP_SUBMENU:
            items = helpMenuItems();
            if (upPress) g_selection = (g_selection - 1 + items.size()) % items.size();
            if (dnPress) g_selection = (g_selection + 1) % items.size();
            if (okPress) {
                if (g_selection == items.size() - 1) {
                    g_state = MAIN_MENU;
                    g_selection = 4;
                } else {
                    // Extract category name from menu item (e.g., "[W] WiFi" -> "WiFi")
                    String menuItem = items[g_selection];
                    int spaceIdx = menuItem.indexOf(' ');
                    String cat = menuItem.substring(spaceIdx + 1);
                    for (size_t i = 0; i < HelpContent::TOPIC_COUNT; i++) {
                        if (String(HelpContent::TOPICS[i].category) == cat) {
                            showResult(HelpContent::TOPICS[i].title,
                                     HelpContent::TOPICS[i].body);
                            break;
                        }
                    }
                }
            }
            drawSimpleMenu(items, g_selection, "HELP");
            break;

        case RESULT_SCREEN:
            Serial.println("\n*** " + g_resultTitle + " ***");
            Serial.println(g_resultBody);
            Serial.println("\nPress OK to continue, BACK to go back");
            if (okPress || backTap) {
                g_state = MAIN_MENU;
                g_selection = 0;
            }
            break;

        default:
            break;
    }
}

bool isActive() {
    return g_state != HOME;
}

} // namespace Menu
